In [1]:
people = {
    "first": ["Corey", 'Jane', 'John'], 
    "last": ["Schafer", 'Doe', 'Doe'], 
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com']
}
people

{'first': ['Corey', 'Jane', 'John'],
 'last': ['Schafer', 'Doe', 'Doe'],
 'email': ['CoreyMSchafer@gmail.com',
  'JaneDoe@email.com',
  'JohnDoe@email.com']}

In [3]:
people['email']

['CoreyMSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com']

In [4]:
import pandas as pd
df = pd.DataFrame(people)
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [5]:
type(df)

pandas.core.frame.DataFrame

In [6]:
df['email']

0    CoreyMSchafer@gmail.com
1          JaneDoe@email.com
2          JohnDoe@email.com
Name: email, dtype: object

In [7]:
df.email

0    CoreyMSchafer@gmail.com
1          JaneDoe@email.com
2          JohnDoe@email.com
Name: email, dtype: object

In [9]:
type(df.email)

pandas.core.series.Series

In [10]:
df[['last', 'email']]

      last                    email
0  Schafer  CoreyMSchafer@gmail.com
1      Doe        JaneDoe@email.com
2      Doe        JohnDoe@email.com

In [11]:
df[['email']]

                     email
0  CoreyMSchafer@gmail.com
1        JaneDoe@email.com
2        JohnDoe@email.com

In [12]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [16]:
df.describe().transpose()

      count unique                      top freq
first     3      3                    Corey    1
last      3      2                      Doe    2
email     3      3  CoreyMSchafer@gmail.com    1

In [17]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [24]:
df.iloc[[0, 1], 2]

0    CoreyMSchafer@gmail.com
1          JaneDoe@email.com
Name: email, dtype: object

In [30]:
df.iloc[0:2]

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com

In [31]:
df.iloc[[0, 1]]

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com

In [32]:
df.iloc[[0, 1], 2]

0    CoreyMSchafer@gmail.com
1          JaneDoe@email.com
Name: email, dtype: object

In [33]:
df.iloc[1:-1]

  first last              email
1  Jane  Doe  JaneDoe@email.com

In [35]:
df.iloc[0, 1]

'Schafer'

In [38]:
df.loc[[0, 1]]

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com

In [40]:
df.loc[[0, 1], ['email']]

                     email
0  CoreyMSchafer@gmail.com
1        JaneDoe@email.com

In [41]:
df.loc[[0, 1], ['email', 'last']]

                     email     last
0  CoreyMSchafer@gmail.com  Schafer
1        JaneDoe@email.com      Doe

**ინდექსირება**

In [42]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [44]:
df.set_index('email', inplace=True)

In [45]:
df

                         first     last
email
CoreyMSchafer@gmail.com  Corey  Schafer
JaneDoe@email.com         Jane      Doe
JohnDoe@email.com         John      Doe

In [46]:
df.index

Index(['CoreyMSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com'], dtype='object', name='email')

In [47]:
df.columns

Index(['first', 'last'], dtype='object')

In [55]:
df.loc['JaneDoe@email.com', 'last']

'Doe'

In [56]:
df.loc['JohnDoe@email.com', 'first']

'John'

In [57]:
df.loc['CoreyMSchafer@gmail.com', 'last']

'Schafer'

In [60]:
df.iloc[2]

first    John
last      Doe
Name: JohnDoe@email.com, dtype: object

In [73]:
df.iloc[[0, 1], 0]

email
CoreyMSchafer@gmail.com    Corey
JaneDoe@email.com           Jane
Name: first, dtype: object

In [76]:
df.iloc[0, 1]

'Schafer'

In [79]:
df.reset_index(inplace=True)

In [80]:
df

                     email  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@email.com   Jane      Doe
2        JohnDoe@email.com   John      Doe

**ფილტრაცია**

In [84]:
flt = df['last'] == 'Doe'

In [88]:
df.loc[flt]

               email first last
1  JaneDoe@email.com  Jane  Doe
2  JohnDoe@email.com  John  Doe

In [82]:
df[df['last'] == 'Doe']

               email first last
1  JaneDoe@email.com  Jane  Doe
2  JohnDoe@email.com  John  Doe

In [91]:
df.loc[flt, 'email']

1    JaneDoe@email.com
2    JohnDoe@email.com
Name: email, dtype: object

In [92]:
df

                     email  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@email.com   Jane      Doe
2        JohnDoe@email.com   John      Doe

In [95]:
flt_2 = (df['last'] == 'Schafer') | (df['first'] == 'John')

In [96]:
flt_2

0     True
1    False
2     True
dtype: bool

In [97]:
df[flt_2]

                     email  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
2        JohnDoe@email.com   John      Doe

In [98]:
df.loc[flt_2]

                     email  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
2        JohnDoe@email.com   John      Doe

In [100]:
df.loc[~flt_2, 'email']

1    JaneDoe@email.com
Name: email, dtype: object

**Add/Remove Row and Columns**

In [102]:
df

                     email  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@email.com   Jane      Doe
2        JohnDoe@email.com   John      Doe

In [103]:
df['first'] + " " + df['last']

0    Corey Schafer
1         Jane Doe
2         John Doe
dtype: object

In [104]:
df['full_name'] = df['first'] + " " + df['last']

In [105]:
df

                     email  first     last      full_name
0  CoreyMSchafer@gmail.com  Corey  Schafer  Corey Schafer
1        JaneDoe@email.com   Jane      Doe       Jane Doe
2        JohnDoe@email.com   John      Doe       John Doe

In [110]:
df['full_name'].str.split()

0    [Corey, Schafer]
1         [Jane, Doe]
2         [John, Doe]
Name: full_name, dtype: object

In [111]:
df['full_name'].str.split(' ', expand=True)

       0        1
0  Corey  Schafer
1   Jane      Doe
2   John      Doe

In [115]:
df.drop(columns=['first', 'last'], inplace=True)

In [116]:
df

                     email      full_name
0  CoreyMSchafer@gmail.com  Corey Schafer
1        JaneDoe@email.com       Jane Doe
2        JohnDoe@email.com       John Doe

In [117]:
df[['first', 'last']] = df['full_name'].str.split(' ', expand=True)

In [118]:
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe

In [143]:
new_row = pd.DataFrame({'first': 'Tony'}, index=[len(df)])
df = pd.concat([df, new_row], ignore_index=True)

In [150]:
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
5                      NaN            NaN   Tony      NaN

In [130]:
df.columns

Index(['email', 'full_name', 'first', 'last', 0], dtype='object')

In [145]:
df.drop(columns=[0], inplace=True)

In [149]:
df.drop(index=[3, 4], inplace=True)

In [137]:
people = {
    'first': ['Tony', 'Steve'], 
    'last': ['Stark', 'Rogers'], 
    'email': ['IronMan@avenge.com', 'Cap@avenge.com']
}
df2 = pd.DataFrame(people)

In [151]:
df2

   first    last               email
0   Tony   Stark  IronMan@avenge.com
1  Steve  Rogers      Cap@avenge.com

In [152]:
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
5                      NaN            NaN   Tony      NaN

In [153]:
df = pd.concat([df, df2])

In [154]:
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
5                      NaN            NaN   Tony      NaN
0       IronMan@avenge.com            NaN   Tony    Stark
1           Cap@avenge.com            NaN  Steve   Rogers

In [158]:
df.reset_index(inplace=True)

In [159]:
df

   level_0  index                    email      full_name  first     last
0        0      0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        1      1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        2      2        JohnDoe@email.com       John Doe   John      Doe
3        3      5                      NaN            NaN   Tony      NaN
4        4      0       IronMan@avenge.com            NaN   Tony    Stark
5        5      1           Cap@avenge.com            NaN  Steve   Rogers

In [161]:
df.drop(columns=['level_0', 'index'], inplace=True)

In [162]:
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3                      NaN            NaN   Tony      NaN
4       IronMan@avenge.com            NaN   Tony    Stark
5           Cap@avenge.com            NaN  Steve   Rogers

In [163]:
df.drop(index=3)

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
4       IronMan@avenge.com            NaN   Tony    Stark
5           Cap@avenge.com            NaN  Steve   Rogers

**sorting Data**

In [164]:
people = {
    'first': ['Corey', 'Jane', 'John', 'Adam'], 
    'last': ['Schafer', 'Doe', 'Doe', 'Doe'], 
    'email': ['CoreyMSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com', 'A@email.com']
}
df = pd.DataFrame(people)
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com
3   Adam      Doe              A@email.com

In [168]:
df.sort_values(by='last', ascending=False)

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com
3   Adam      Doe              A@email.com

In [171]:
df.sort_values(by=['last', 'first'], ascending=False, inplace=True)

In [172]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
2   John      Doe        JohnDoe@email.com
1   Jane      Doe        JaneDoe@email.com
3   Adam      Doe              A@email.com

In [175]:
df.sort_index(inplace=True)

In [176]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com
3   Adam      Doe              A@email.com

In [180]:
flt_doe = df['last'] == 'Doe'
df.drop(index=df[flt_doe].index, inplace=True)

In [181]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com